[
  {
    "name": "Radar Sensing Lab",
    "description": "Radar Sensing Lab works in the broad spectrum of applications of radar. In particular, the team currently works on problems specific to automotive, medical, and communication applications. The availability of off-the-shelf radars has enabled us to explore new problems and their applicability. We work closely with the industry and are open to collaboration with universities and government organizations. The team and infrastructure are progressively growing to accept challenging problems and solve them.",
    "areas": [
      "Signal Processing for radars adopted in applications related to automotive",
      "Medical",
      "Human activity recognition",
      "Imaging",
      "ISAC"
    ],
    "faculty": [
      {
        "name": "Vinod Veera Reddy",
        "email": "vinod.reddy@iiitb.ac.in"
      }
    ]
  },
  {
    "name": "CSSMP (Complex Systems & Soft Matter Physics)",
    "description": "The areas of theoretical research of the CSSMP group are interdisciplinary, principally in nonlinear dynamics, soft matter & complex fluids, physics of living systems, modelling of complex systems at different scales and aspects of quantum computing.",
    "areas": [
      "Complex systems",
      "Nonlinear dynamics",
      "Soft matter physics",
      "Aspects of quantum computing"
    ],
    "faculty": [
      {
        "name": "Balakrishnan Ashok",
        "email": "bashok@iiitb.ac.in"
      }
    ]
  },
  {
    "name": "Multimodal Perception Lab",
    "description": "The Multimodal Perception lab focuses on human-centered sensing and multimodal signal processing methods to observe, measure, and model human behavior. These methods are used in applications that facilitate behavioral training, and enable human-agent interactions (HRI).",
    "areas": [
      "Multimodal conversational systems",
      "Applied Computer Vision"
    ],
    "faculty": [
      {
        "name": "Dinesh Babu J",
        "email": "jdinesh@iiitb.ac.in"
      }
    ]
  },
  {
    "name": "3D Vision and Language",
    "description": "This lab focus on recognition problems involving objects in 3D world and language guided exploration in 3D environments.",
    "areas": [
      "Few Shot Object Segmentation",
      "CAD Model based Object Part Segmentation",
      "Generative AI for solving 3D vision problems (6D Pose estimation)",
      "Language guided exploration in 3D environments"
    ],
    "faculty": [
      {
        "name": "Viswanath Gopalakrishnan",
        "email": "viswanath.g@iiitb.ac.in"
      }
    ]
  },
  {
    "name": "Robotics Studio",
    "description": "The Robotics Lab consists of an indoor platform where drones and ground robots can be operated; it also has industry-grade robotic manipulators. The lab focuses on the use of Robots in industrial verticals such as Warehousing and Manufacturing. At a fundamental level, research is carried out in the areas of 1. multi-robot systems - coordination, path planning, and navigation;  2. Using multi-modal sensor data, such as cameras and depth sensors for localization and navigation; 3. Haptics for rehabilitation robots; 4. Visual Art - choreography and path-planning to music.",
    "areas": [
      "Warehousing",
      "Manufacturing",
      "Rehabilitation",
      "Construction",
      "Drone-based delivery",
      "Augmented Reality"
    ],
    "faculty": [
      {
        "name": "Sachit Rao",
        "email": "sachit@iiitb.ac.in"
      }
    ]
  },
  {
    "name": "Web Science Lab",
    "description": "The Web Science Lab (WSL) at IIIT Bangalore is interested in understanding how the Internet, WWW and AI affects different facets of human life. The Internet, WWW and now AI have brought about massive changes on human life in just about all facets– be it in business, administration, social well-being, personal relationships, education, etc. While these technologies continue to evolve at a rapid pace, there is relatively little attention given to how we as humans are transforming in this new world.",
    "areas": [
      "AI Systems and Ethics",
      "Multi-Agent Systems",
      "Natural Language Processing",
      "Network Science",
      "Conceptual Modeling"
    ],
    "faculty": [
      {
        "name": "Srinath Srinivasa",
        "email": "sri@iiitb.ac.in"
      },
      {
        "name": "Sushree Behera",
        "email": "sushree.behera@iiitb.ac.in"
      }
    ]
  },
  {
    "name": "Networking and Communication Research Lab (NCRL)",
    "description": "Networking and Communication Research Lab (NCRL) in IIIT-Bangalore mainly focuses on various R&D areas related to 5G, 6G and wireless networks. Recent major areas of work include scheduling schemes in 5G and 6G, network slicing, IoT Security, Enhancing QoS and QoE for 5G and 6G networks, Massive Multiple Input Multiple Output (MIMO), Unmanned Aerial Vehicles (UAV) and Intelligent Reflecting Surfaces (IRS).",
    "areas": [
      "Network Slicing",
      "IoT",
      "Massive MIMO and IRS"
    ],
    "faculty": [
      {
        "name": "Debabrata Das",
        "email": "dDas@iiitb.ac.in"
      },
      {
        "name": "Jyotsna Bapat",
        "email": "jbapat@iiitb.ac.in"
      },
      {
        "name": "Amrita Mishra",
        "email": "amrita.mishra@iiitb.ac.in"
      }
    ]
  },
  {
    "name": "Graph-Geometry-Topology Lab (GGTL)",
    "description": "GGTL engages in the exploration of fundamental questions within the domains of Algorithmic Graph Theory, Computational Geometry, and Computational Topology. The problems addressed by GGTL are well-motivated by their applications in Topological Data Analysis, Robotics, Networks, and Wireless Communication. The emphasis of the research conducted at GGTL is on the design of algorithms that are not only efficient but also provide mathematical guarantees for their effectiveness in addressing the challenges encountered in these fields.",
    "areas": [
      "Algorithmic Graph Theory",
      "Computational Geometry",
      "Computational Topology",
      "Data Analysis",
      "Parameterised Algorithms",
      "Approximation Algorithms"
    ],
    "faculty": [
      {
        "name": "Pradeesha Ashok",
        "email": "Pradeesha@iiitb.ac.in"
      },
      {
        "name": "Amit Chattopadhyay",
        "email": "a.chattopadhyay@iiitb.ac.in"
      }
    ]
  },
  {
    "name": "Thin Film Flow Modeling and Instabilities Lab (TFFMIL)",
    "description": "Our research group is committed to revolutionizing the understanding of the flow of thin films, their instabilities, interactions with complex surfaces, the effect of different body/external forces like electric, magnetic, or temperature fields, contamination like soluble/insoluble surfactant effects, and for various types of fluid rheologies, Newtonian and non-Newtonian. By developing cutting-edge analytical and semi-analytical mathematical models and advanced numerical techniques, we delve into hydrodynamics, interfacial phenomena, and flow control across a wide range of applications, from microfluidics to porous media.",
    "areas": [
      "Mathematical Modelling and Computing",
      "Dynamics and Instabilities of Thin Film Flow"
    ],
    "faculty": [
      {
        "name": "Sanghasri Mukhopadhyay",
        "email": "Sanghasri.M@iiitb.ac.in"
      }
    ]
  },
  {
    "name": "Centre for Accessibility in the Global South",
    "description": "CAGS is a research-based multidisciplinary centre for disability studies, with a focus on the Global South. The centre focuses on creating a network and a shared platform for bridging together industry, academia and organizations working with people with disabilities, to create accessible solutions.",
    "areas": [
      "Accessible Education",
      "Assistive Technology (AT) in the Global South",
      "Digital Inclusive Learning Ecosystem"
    ],
    "faculty": [
      {
        "name": "Amit Prakash",
        "email": "kartik.joshi@iiitb.ac.in"
      }
    ]
  },
  {
    "name": "Stochastic Control Lab (SCL)",
    "description": "Our research group focuses on the theory and applications of problems associated with stochastic optimal control. Specifically, we study and solve problems in the areas of Reinforcement Learning, Multi-agent learning, and Deep learning. Applications include Robotics, UAVs, and Large Language Models.",
    "areas": [
      "Reinforcement Learning",
      "Multi-Agent Learning",
      "Stochastic Approximation",
      "Deep Learning",
      "Machine Learning"
    ],
    "faculty": [
      {
        "name": "Raghuram Bharadwaj Diddigi",
        "email": "chainesh.gautam@iiitb.ac.in"
      }
    ]
  },
  {
    "name": "Scalable Data Science and AI (ScaDS.ai) Lab",
    "description": "The Scalable Data Science (ScaDS) Lab was established by Prof. Vinu E. Venugopal in 2021 at the International Institute of Information Technology Bangalore (IIITB). Our research team is dedicated to creating scalable solutions for a variety of big data challenges. Our current research efforts are concentrated on two main areas: 1. Advancing Neuro-Symbolic AI: We are developing robust AI algorithms to enhance reasoning capabilities. 2. Distributed Streaming Data Systems: We are designing architectures to efficiently process spanning events.",
    "areas": [
      "Big Data",
      "Neuro-symbolic AI",
      "Explainable AI",
      "Streaming Data Systems",
      "Knowledge Graphs"
    ],
    "faculty": [
      {
        "name": "Vinu Ellampallil Venugopal",
        "email": "vinu.ev@iiitb.ac.in"
      }
    ]
  },
  {
    "name": "E-Health Research Center (EHRC)",
    "description": "Applied research in leveraging digital technologies to improve delivery of health care services, with a focus on mental health, malnutrition and disabilities, and on public health. The center is involved in multiple inter-disciplinary research programs in collaboration with leading medical establishments and with the national and state governments.",
    "areas": [
      "Public health systems",
      "Medical image analysis",
      "Visual data exploration",
      "Assistive devices",
      "Robotic surgery",
      "Health data privacy"
    ],
    "faculty": [
      {
        "name": "T K Srikanth",
        "email": "tk.srikanth@iiitb.ac.in"
      },
      {
        "name": "Jaya Sreevalsan Nair",
        "email": "jaya@iiitb.ac.in"
      },
      {
        "name": "Amit Prakash",
        "email": "amit.prakash@iiitb.ac.in"
      },
      {
        "name": "Madhav Rao",
        "email": "madhav.rao@iiitb.ac.in"
      },
      {
        "name": "Akash Narayana",
        "email": "akash.narayana@iiitb.ac.in"
      }
    ]
  },
  {
    "name": "COMET Lab",
    "description": "The lab focuses on embedded system design for 5G and beyond wireless communication system design.",
    "areas": [
      "Wireless communication"
    ],
    "faculty": [
      {
        "name": "Prem Singh",
        "email": "prem.singh@iiitb.ac.in"
      }
    ]
  },
  {
    "name": "Computational Fluid Dynamics Lab",
    "description": "Our lab's current research activity is in the area of simulations and modelling of three dimensional Hydrodynamic and magnetohydrodynamic turbulent flows. These include rotating turbulent flows as well. We are now trying to understand some of the topological properties of the flow through the use of computational topology.",
    "areas": [
      "Simulations of 3D HD and MHD turbulent flows",
      "Quantum Internet protocols"
    ],
    "faculty": [
      {
        "name": "Shiva Kumar Malapaka",
        "email": "malapaka@iiitb.ac.in"
      }
    ]
  },
  {
    "name": "Intelligent Hardware and System lab",
    "description": "Our lab focuses on optimizing hardware accelerators for a range of applications, including CNNs, cryptography, and ML, by designing efficient multiplier architectures, systolic arrays, and error-balanced automation flows.",
    "areas": [
      "ML",
      "CNN",
      "Neuromorphic System",
      "Cryptography",
      "Optimization"
    ],
    "faculty": [
      {
        "name": "Madhav Rao",
        "email": "pruthvi.parate@iiitb.ac.in"
      }
    ]
  },
  {
    "name": "Software Engineering and Analysis Lab",
    "description": "We work on the formal aspects of software engineering, in particular, formal verification, program analysis and software testing. We apply these analysis techniques to a variety of applications, e.g. web applications, DPIs and AI/ML systems.",
    "areas": [
      "Formal verification",
      "Program analysis",
      "Software testing"
    ],
    "faculty": [
      {
        "name": "Sujit Kumar Chakrabarti",
        "email": "sujitkc@iiitb.ac.in"
      },
      {
        "name": "Meenakshi D'Souza",
        "email": "meenakshi@iiitb.ac.in"
      }
    ]
  },
  {
    "name": "AutoGrow Lab",
    "description": "In the lab we carry out experimental research to grow plants autonomously by use of IoT and AI/ML.",
    "areas": [
      "AgriTech",
      "Precision farming",
      "Autonomous Agriculture"
    ],
    "faculty": [
      {
        "name": "Ramesh Kestur",
        "email": "rameshkestur@iiitb.ac.in"
      },
      {
        "name": "Madhav Rao",
        "email": "madhav.rao@iiitb.ac.in"
      }
    ]
  },
  {
    "name": "Speech Lab",
    "description": "Our work is centrally on ASR (Automatic Speech Recognition), spanning topics such as multi-lingual ASR with Indian languages applications, end-to-end (E2E) ASR architectures, attention mechanisms, unsupervised representation learning for low-resource ASR, analysis-by-synthesis frameworks for ASR, few-shot learning (FSL) for E2E ASR, associative memory formulations, multi-modal associative learning and cross-domain speech recognition.",
    "areas": [
      "Automatic Speech Recognition",
      "Associative Memory Formulations",
      "Machine Learning",
      "Deep Learning",
      "Few-Shot Learning",
      "Self-Supervised Learning"
    ],
    "faculty": [
      {
        "name": "V. Ramasubramanian",
        "email": "v.ramasubramanian@iiitb.ac.in"
      }
    ]
  },
  {
    "name": "Center for Technology Research and Innovation for Digital Governance (CTRI-DG)",
    "description": "CTRI-DG is set-up by Center for E-Governance, Govt of Karnataka for carrying out cutting-edge research across the entire spectrum of software engineering.",
    "areas": [
      "Model-based software engineering",
      "Software architecture",
      "Formal verification & validation",
      "Modern software engineering practices including devlops",
      "Cloud"
    ],
    "faculty": [
      {
        "name": "Chandrashekar R",
        "email": "rc@iiitb.ac.in"
      },
      {
        "name": "Sujit Kumar Chakrabarti",
        "email": "sujitkc@iiitb.ac.in"
      },
      {
        "name": "Meenakshi D'Souza",
        "email": "meenakshi@iiitb.ac.in"
      },
      {
        "name": "Thangaraju S",
        "email": "thangaraju.s@iiitb.ac.in"
      },
      {
        "name": "Srikanth T K",
        "email": "tk.srikanth@iiitb.ac.in"
      },
      {
        "name": "Sridhar V",
        "email": "sridhar.v@iiitb.ac.in"
      },
      {
        "name": "Vivek Yadav",
        "email": "vivek.yadav@iiitb.ac.in"
      }
    ]
  },
  {
    "name": "Advanced Wireless Communications Lab",
    "description": "The \"Advanced Wireless Communications Lab\" is focused on developing next generation wireless communication technologies (e.g., MIMO technologies, Cognitive Radio technologies, Cooperative Communication, Physical Layer Security, Energy Harvesting Networks, Green Communication, mmWave communication systems, and Intelligent Reflecting Surfaces). Emphasis will be on building new wireless communication systems and development of new technologies with their performance analyses.",
    "areas": [
      "MIMO technologies",
      "Cognitive Radio technologies",
      "Cooperative Communication",
      "Physical Layer Security",
      "Energy Harvesting Networks",
      "Green Communication",
      "mmWave communication systems",
      "Intelligent Reflecting Surfaces"
    ],
    "faculty": [
      {
        "name": "Priyanka Das",
        "email": "priyanka.das@iiitb.ac.in"
      }
    ]
  },
  {
    "name": "Center for Internet of Ethical Things (CIET)",
    "description": "The Center for Internet of Ethical Things (CIET) was established with a clear mission to drive research, innovation, and development in the rapidly evolving field of Internet of Things (IoT) technologies. As IoT continues to integrate into every facet of our lives—from smart homes and cities to healthcare and industry—the importance of addressing the ethical and moral implications of these technologies has become increasingly vital.",
    "areas": [
      "Ethics",
      "Ethics by Design",
      "Ethical Software",
      "Software Architecture"
    ],
    "faculty": [
      {
        "name": "Chandrashekar Ramanathan",
        "email": "apurva.kulkarni@iiitb.ac.in"
      }
    ]
  },
  {
    "name": "IIITB COMET Foundation",
    "description": "IIITB COMET Foundation is a Technology Innovation Hub (TIH) established by IIITB under the National Mission on Interdisciplinary Cyber-Physical Systems (NM-ICPS), Department of Science and Technology (DST), Government of India.",
    "areas": [
      "Advanced Communication Systems"
    ],
    "faculty": [
      {
        "name": "Sridhar Pillalamarri",
        "email": "sridhar.p@iiitb.ac.in"
      },
      {
        "name": "Ajay Bakre",
        "email": "ajay.bakre@iiitb.ac.in"
      },
      {
        "name": "Jyotsna Bapat",
        "email": "jbapat@iiitb.ac.in"
      },
      {
        "name": "Prem Singh",
        "email": "prem.singh@iiitb.ac.in"
      },
      {
        "name": "Vinod Reddy",
        "email": "vinod.reddy@iiitb.ac.in"
      },
      {
        "name": "Priyanka Das",
        "email": "priyanka.das@iiitb.ac.in"
      },
      {
        "name": "Amrita Mishra",
        "email": "amrita.mishra@iiitb.ac.in"
      }
    ]
  },
  {
    "name": "Spatial Computing Lab",
    "description": "The Spatial Computing Laboratory at IIIT Bangalore aims to study general and specific topics in spatial computing, spatial data science/data mining, spatial databases, geo-statistical techniques and time-series forecasting models. The common thread in our research is to apply Advancements in Geospatial Technologies, Data Science, Artificial Intelligence and Statistical Methods to research problems at the interface of Computer Science and Spatio-Temporal Data of the Earth Observing Systems.",
    "areas": [
      "Machine learning and Deep learning in Geospatial Science",
      "Time-series forecasting models",
      "Spatio-temporal models",
      "Urban growth modelling",
      "Urban climate",
      "SAR data analysis",
      "UAV data analysis"
    ],
    "faculty": [
      {
        "name": "Rahisha Thottolil",
        "email": "uttam@iiitb.ac.in"
      }
    ]
  },
  {
    "name": "Connected Devices and Wearables Lab",
    "description": "Our group focusses on researching hardware and systems for connected devices and wearables constituting Internet of Bodies (IoB). IoB is an extension of IoT, wherein connected things in, on and around the human body senses and share vital information about the body to remote servers in the cloud for continuous and long-time monitoring of the individual and surroundings.",
    "areas": [
      "Hardware Security",
      "Edge AI/ML",
      "Human Body Communication"
    ],
    "faculty": [
      {
        "name": "Kurian Polachan",
        "email": "kurian.polachan@iiitb.ac.in"
      }
    ]
  }
]